share/tutorials/incompressible/simple/wind_around_buildings/constant/turbulenceProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      RASProperties;
}

simulationType RAS;
RAS
{
  RASModel        kEpsilon;
  turbulence      on;
  printCoeffs     on;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
