share/tutorials/incompressible/simple/wind_around_buildings/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      fvSolution;
}

solvers
{
  p
  {
    solver          GAMG;
    smoother        GaussSeidel;
    cacheAgglomeration on;
    agglomerator    faceAreaPair;
    nCellsInCoarsestLevel 10;
    mergeLevels     1;
    tolerance       1e-6;
    relTol          0.1;
  }
  "(U|k|omega|epsilon)"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-6;
    relTol          0.1;
  }
}
SIMPLE
{
  residualControl
  {
    p               1e-4;
    U               1e-4;
    "(k|omega|epsilon)" 1e-4;
  }
  nNonOrthogonalCorrectors 0;
  pRefCell        0;
  pRefValue       0;
}
potentialFlow
{
  nNonOrthogonalCorrectors 10;
}
relaxationFactors
{
  fields
  {
    p               0.3;
  }
  equations
  {
    U               0.7;
    "(k|omega|epsilon).*" 0.7;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
