share/tutorials/incompressible/simple/wind_around_buildings/system/surfaceFeatureExtractDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      surfaceFeatureExtractDict;
}

buildings.obj
{
  #includeEtc "case_dicts/surface/surfaceFeatureExtractDict.conf"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
